; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p12---int100n150-m25---int100c200---s271---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 - fuellevel
)

(:init
(sum level0 level6 level6)
(sum level0 level8 level8)
(sum level0 level9 level9)
(sum level0 level10 level10)
(sum level0 level11 level11)
(sum level0 level18 level18)
(sum level1 level6 level7)
(sum level1 level8 level9)
(sum level1 level9 level10)
(sum level1 level10 level11)
(sum level1 level11 level12)
(sum level1 level18 level19)
(sum level2 level6 level8)
(sum level2 level8 level10)
(sum level2 level9 level11)
(sum level2 level10 level12)
(sum level2 level11 level13)
(sum level2 level18 level20)
(sum level3 level6 level9)
(sum level3 level8 level11)
(sum level3 level9 level12)
(sum level3 level10 level13)
(sum level3 level11 level14)
(sum level3 level18 level21)
(sum level4 level6 level10)
(sum level4 level8 level12)
(sum level4 level9 level13)
(sum level4 level10 level14)
(sum level4 level11 level15)
(sum level4 level18 level22)
(sum level5 level6 level11)
(sum level5 level8 level13)
(sum level5 level9 level14)
(sum level5 level10 level15)
(sum level5 level11 level16)
(sum level5 level18 level23)
(sum level6 level6 level12)
(sum level6 level8 level14)
(sum level6 level9 level15)
(sum level6 level10 level16)
(sum level6 level11 level17)
(sum level6 level18 level24)
(sum level7 level6 level13)
(sum level7 level8 level15)
(sum level7 level9 level16)
(sum level7 level10 level17)
(sum level7 level11 level18)
(sum level7 level18 level25)
(sum level8 level6 level14)
(sum level8 level8 level16)
(sum level8 level9 level17)
(sum level8 level10 level18)
(sum level8 level11 level19)
(sum level8 level18 level26)
(sum level9 level6 level15)
(sum level9 level8 level17)
(sum level9 level9 level18)
(sum level9 level10 level19)
(sum level9 level11 level20)
(sum level9 level18 level27)
(sum level10 level6 level16)
(sum level10 level8 level18)
(sum level10 level9 level19)
(sum level10 level10 level20)
(sum level10 level11 level21)
(sum level10 level18 level28)
(sum level11 level6 level17)
(sum level11 level8 level19)
(sum level11 level9 level20)
(sum level11 level10 level21)
(sum level11 level11 level22)
(sum level11 level18 level29)
(sum level12 level6 level18)
(sum level12 level8 level20)
(sum level12 level9 level21)
(sum level12 level10 level22)
(sum level12 level11 level23)
(sum level12 level18 level30)
(sum level13 level6 level19)
(sum level13 level8 level21)
(sum level13 level9 level22)
(sum level13 level10 level23)
(sum level13 level11 level24)
(sum level13 level18 level31)
(sum level14 level6 level20)
(sum level14 level8 level22)
(sum level14 level9 level23)
(sum level14 level10 level24)
(sum level14 level11 level25)
(sum level14 level18 level32)
(sum level15 level6 level21)
(sum level15 level8 level23)
(sum level15 level9 level24)
(sum level15 level10 level25)
(sum level15 level11 level26)
(sum level15 level18 level33)
(sum level16 level6 level22)
(sum level16 level8 level24)
(sum level16 level9 level25)
(sum level16 level10 level26)
(sum level16 level11 level27)
(sum level16 level18 level34)
(sum level17 level6 level23)
(sum level17 level8 level25)
(sum level17 level9 level26)
(sum level17 level10 level27)
(sum level17 level11 level28)
(sum level17 level18 level35)
(sum level18 level6 level24)
(sum level18 level8 level26)
(sum level18 level9 level27)
(sum level18 level10 level28)
(sum level18 level11 level29)
(sum level18 level18 level36)
(sum level19 level6 level25)
(sum level19 level8 level27)
(sum level19 level9 level28)
(sum level19 level10 level29)
(sum level19 level11 level30)
(sum level19 level18 level37)
(sum level20 level6 level26)
(sum level20 level8 level28)
(sum level20 level9 level29)
(sum level20 level10 level30)
(sum level20 level11 level31)
(sum level20 level18 level38)
(sum level21 level6 level27)
(sum level21 level8 level29)
(sum level21 level9 level30)
(sum level21 level10 level31)
(sum level21 level11 level32)
(sum level21 level18 level39)
(sum level22 level6 level28)
(sum level22 level8 level30)
(sum level22 level9 level31)
(sum level22 level10 level32)
(sum level22 level11 level33)
(sum level22 level18 level40)
(sum level23 level6 level29)
(sum level23 level8 level31)
(sum level23 level9 level32)
(sum level23 level10 level33)
(sum level23 level11 level34)
(sum level23 level18 level41)
(sum level24 level6 level30)
(sum level24 level8 level32)
(sum level24 level9 level33)
(sum level24 level10 level34)
(sum level24 level11 level35)
(sum level24 level18 level42)
(sum level25 level6 level31)
(sum level25 level8 level33)
(sum level25 level9 level34)
(sum level25 level10 level35)
(sum level25 level11 level36)
(sum level25 level18 level43)
(sum level26 level6 level32)
(sum level26 level8 level34)
(sum level26 level9 level35)
(sum level26 level10 level36)
(sum level26 level11 level37)
(sum level26 level18 level44)
(sum level27 level6 level33)
(sum level27 level8 level35)
(sum level27 level9 level36)
(sum level27 level10 level37)
(sum level27 level11 level38)
(sum level27 level18 level45)
(sum level28 level6 level34)
(sum level28 level8 level36)
(sum level28 level9 level37)
(sum level28 level10 level38)
(sum level28 level11 level39)
(sum level28 level18 level46)
(sum level29 level6 level35)
(sum level29 level8 level37)
(sum level29 level9 level38)
(sum level29 level10 level39)
(sum level29 level11 level40)
(sum level29 level18 level47)
(sum level30 level6 level36)
(sum level30 level8 level38)
(sum level30 level9 level39)
(sum level30 level10 level40)
(sum level30 level11 level41)
(sum level30 level18 level48)
(sum level31 level6 level37)
(sum level31 level8 level39)
(sum level31 level9 level40)
(sum level31 level10 level41)
(sum level31 level11 level42)
(sum level31 level18 level49)
(sum level32 level6 level38)
(sum level32 level8 level40)
(sum level32 level9 level41)
(sum level32 level10 level42)
(sum level32 level11 level43)
(sum level32 level18 level50)
(sum level33 level6 level39)
(sum level33 level8 level41)
(sum level33 level9 level42)
(sum level33 level10 level43)
(sum level33 level11 level44)
(sum level33 level18 level51)
(sum level34 level6 level40)
(sum level34 level8 level42)
(sum level34 level9 level43)
(sum level34 level10 level44)
(sum level34 level11 level45)
(sum level34 level18 level52)
(sum level35 level6 level41)
(sum level35 level8 level43)
(sum level35 level9 level44)
(sum level35 level10 level45)
(sum level35 level11 level46)
(sum level35 level18 level53)
(sum level36 level6 level42)
(sum level36 level8 level44)
(sum level36 level9 level45)
(sum level36 level10 level46)
(sum level36 level11 level47)
(sum level36 level18 level54)
(sum level37 level6 level43)
(sum level37 level8 level45)
(sum level37 level9 level46)
(sum level37 level10 level47)
(sum level37 level11 level48)
(sum level37 level18 level55)
(sum level38 level6 level44)
(sum level38 level8 level46)
(sum level38 level9 level47)
(sum level38 level10 level48)
(sum level38 level11 level49)
(sum level38 level18 level56)
(sum level39 level6 level45)
(sum level39 level8 level47)
(sum level39 level9 level48)
(sum level39 level10 level49)
(sum level39 level11 level50)
(sum level39 level18 level57)
(sum level40 level6 level46)
(sum level40 level8 level48)
(sum level40 level9 level49)
(sum level40 level10 level50)
(sum level40 level11 level51)
(sum level40 level18 level58)
(sum level41 level6 level47)
(sum level41 level8 level49)
(sum level41 level9 level50)
(sum level41 level10 level51)
(sum level41 level11 level52)
(sum level41 level18 level59)
(sum level42 level6 level48)
(sum level42 level8 level50)
(sum level42 level9 level51)
(sum level42 level10 level52)
(sum level42 level11 level53)
(sum level42 level18 level60)
(sum level43 level6 level49)
(sum level43 level8 level51)
(sum level43 level9 level52)
(sum level43 level10 level53)
(sum level43 level11 level54)
(sum level43 level18 level61)
(sum level44 level6 level50)
(sum level44 level8 level52)
(sum level44 level9 level53)
(sum level44 level10 level54)
(sum level44 level11 level55)
(sum level44 level18 level62)
(sum level45 level6 level51)
(sum level45 level8 level53)
(sum level45 level9 level54)
(sum level45 level10 level55)
(sum level45 level11 level56)
(sum level45 level18 level63)
(sum level46 level6 level52)
(sum level46 level8 level54)
(sum level46 level9 level55)
(sum level46 level10 level56)
(sum level46 level11 level57)
(sum level46 level18 level64)
(sum level47 level6 level53)
(sum level47 level8 level55)
(sum level47 level9 level56)
(sum level47 level10 level57)
(sum level47 level11 level58)
(sum level47 level18 level65)
(sum level48 level6 level54)
(sum level48 level8 level56)
(sum level48 level9 level57)
(sum level48 level10 level58)
(sum level48 level11 level59)
(sum level48 level18 level66)
(sum level49 level6 level55)
(sum level49 level8 level57)
(sum level49 level9 level58)
(sum level49 level10 level59)
(sum level49 level11 level60)
(sum level49 level18 level67)
(sum level50 level6 level56)
(sum level50 level8 level58)
(sum level50 level9 level59)
(sum level50 level10 level60)
(sum level50 level11 level61)
(sum level50 level18 level68)
(sum level51 level6 level57)
(sum level51 level8 level59)
(sum level51 level9 level60)
(sum level51 level10 level61)
(sum level51 level11 level62)
(sum level51 level18 level69)
(sum level52 level6 level58)
(sum level52 level8 level60)
(sum level52 level9 level61)
(sum level52 level10 level62)
(sum level52 level11 level63)
(sum level52 level18 level70)
(sum level53 level6 level59)
(sum level53 level8 level61)
(sum level53 level9 level62)
(sum level53 level10 level63)
(sum level53 level11 level64)
(sum level53 level18 level71)
(sum level54 level6 level60)
(sum level54 level8 level62)
(sum level54 level9 level63)
(sum level54 level10 level64)
(sum level54 level11 level65)
(sum level54 level18 level72)
(sum level55 level6 level61)
(sum level55 level8 level63)
(sum level55 level9 level64)
(sum level55 level10 level65)
(sum level55 level11 level66)
(sum level55 level18 level73)
(sum level56 level6 level62)
(sum level56 level8 level64)
(sum level56 level9 level65)
(sum level56 level10 level66)
(sum level56 level11 level67)
(sum level56 level18 level74)
(sum level57 level6 level63)
(sum level57 level8 level65)
(sum level57 level9 level66)
(sum level57 level10 level67)
(sum level57 level11 level68)
(sum level57 level18 level75)
(sum level58 level6 level64)
(sum level58 level8 level66)
(sum level58 level9 level67)
(sum level58 level10 level68)
(sum level58 level11 level69)
(sum level58 level18 level76)
(sum level59 level6 level65)
(sum level59 level8 level67)
(sum level59 level9 level68)
(sum level59 level10 level69)
(sum level59 level11 level70)
(sum level59 level18 level77)
(sum level60 level6 level66)
(sum level60 level8 level68)
(sum level60 level9 level69)
(sum level60 level10 level70)
(sum level60 level11 level71)
(sum level60 level18 level78)
(sum level61 level6 level67)
(sum level61 level8 level69)
(sum level61 level9 level70)
(sum level61 level10 level71)
(sum level61 level11 level72)
(sum level61 level18 level79)
(sum level62 level6 level68)
(sum level62 level8 level70)
(sum level62 level9 level71)
(sum level62 level10 level72)
(sum level62 level11 level73)
(sum level62 level18 level80)
(sum level63 level6 level69)
(sum level63 level8 level71)
(sum level63 level9 level72)
(sum level63 level10 level73)
(sum level63 level11 level74)
(sum level63 level18 level81)
(sum level64 level6 level70)
(sum level64 level8 level72)
(sum level64 level9 level73)
(sum level64 level10 level74)
(sum level64 level11 level75)
(sum level64 level18 level82)
(sum level65 level6 level71)
(sum level65 level8 level73)
(sum level65 level9 level74)
(sum level65 level10 level75)
(sum level65 level11 level76)
(sum level65 level18 level83)
(sum level66 level6 level72)
(sum level66 level8 level74)
(sum level66 level9 level75)
(sum level66 level10 level76)
(sum level66 level11 level77)
(sum level66 level18 level84)
(sum level67 level6 level73)
(sum level67 level8 level75)
(sum level67 level9 level76)
(sum level67 level10 level77)
(sum level67 level11 level78)
(sum level67 level18 level85)
(sum level68 level6 level74)
(sum level68 level8 level76)
(sum level68 level9 level77)
(sum level68 level10 level78)
(sum level68 level11 level79)
(sum level68 level18 level86)
(sum level69 level6 level75)
(sum level69 level8 level77)
(sum level69 level9 level78)
(sum level69 level10 level79)
(sum level69 level11 level80)
(sum level69 level18 level87)
(sum level70 level6 level76)
(sum level70 level8 level78)
(sum level70 level9 level79)
(sum level70 level10 level80)
(sum level70 level11 level81)
(sum level70 level18 level88)
(sum level71 level6 level77)
(sum level71 level8 level79)
(sum level71 level9 level80)
(sum level71 level10 level81)
(sum level71 level11 level82)
(sum level71 level18 level89)
(sum level72 level6 level78)
(sum level72 level8 level80)
(sum level72 level9 level81)
(sum level72 level10 level82)
(sum level72 level11 level83)
(sum level72 level18 level90)
(sum level73 level6 level79)
(sum level73 level8 level81)
(sum level73 level9 level82)
(sum level73 level10 level83)
(sum level73 level11 level84)
(sum level73 level18 level91)
(sum level74 level6 level80)
(sum level74 level8 level82)
(sum level74 level9 level83)
(sum level74 level10 level84)
(sum level74 level11 level85)
(sum level74 level18 level92)
(sum level75 level6 level81)
(sum level75 level8 level83)
(sum level75 level9 level84)
(sum level75 level10 level85)
(sum level75 level11 level86)
(sum level75 level18 level93)
(sum level76 level6 level82)
(sum level76 level8 level84)
(sum level76 level9 level85)
(sum level76 level10 level86)
(sum level76 level11 level87)
(sum level76 level18 level94)
(sum level77 level6 level83)
(sum level77 level8 level85)
(sum level77 level9 level86)
(sum level77 level10 level87)
(sum level77 level11 level88)
(sum level77 level18 level95)
(sum level78 level6 level84)
(sum level78 level8 level86)
(sum level78 level9 level87)
(sum level78 level10 level88)
(sum level78 level11 level89)
(sum level78 level18 level96)
(sum level79 level6 level85)
(sum level79 level8 level87)
(sum level79 level9 level88)
(sum level79 level10 level89)
(sum level79 level11 level90)
(sum level79 level18 level97)
(sum level80 level6 level86)
(sum level80 level8 level88)
(sum level80 level9 level89)
(sum level80 level10 level90)
(sum level80 level11 level91)
(sum level80 level18 level98)
(sum level81 level6 level87)
(sum level81 level8 level89)
(sum level81 level9 level90)
(sum level81 level10 level91)
(sum level81 level11 level92)
(sum level81 level18 level99)
(sum level82 level6 level88)
(sum level82 level8 level90)
(sum level82 level9 level91)
(sum level82 level10 level92)
(sum level82 level11 level93)
(sum level82 level18 level100)
(sum level83 level6 level89)
(sum level83 level8 level91)
(sum level83 level9 level92)
(sum level83 level10 level93)
(sum level83 level11 level94)
(sum level83 level18 level101)
(sum level84 level6 level90)
(sum level84 level8 level92)
(sum level84 level9 level93)
(sum level84 level10 level94)
(sum level84 level11 level95)
(sum level84 level18 level102)
(sum level85 level6 level91)
(sum level85 level8 level93)
(sum level85 level9 level94)
(sum level85 level10 level95)
(sum level85 level11 level96)
(sum level85 level18 level103)
(sum level86 level6 level92)
(sum level86 level8 level94)
(sum level86 level9 level95)
(sum level86 level10 level96)
(sum level86 level11 level97)
(sum level86 level18 level104)
(sum level87 level6 level93)
(sum level87 level8 level95)
(sum level87 level9 level96)
(sum level87 level10 level97)
(sum level87 level11 level98)
(sum level87 level18 level105)
(sum level88 level6 level94)
(sum level88 level8 level96)
(sum level88 level9 level97)
(sum level88 level10 level98)
(sum level88 level11 level99)
(sum level88 level18 level106)
(sum level89 level6 level95)
(sum level89 level8 level97)
(sum level89 level9 level98)
(sum level89 level10 level99)
(sum level89 level11 level100)
(sum level90 level6 level96)
(sum level90 level8 level98)
(sum level90 level9 level99)
(sum level90 level10 level100)
(sum level90 level11 level101)
(sum level91 level6 level97)
(sum level91 level8 level99)
(sum level91 level9 level100)
(sum level91 level10 level101)
(sum level91 level11 level102)
(sum level92 level6 level98)
(sum level92 level8 level100)
(sum level92 level9 level101)
(sum level92 level10 level102)
(sum level92 level11 level103)
(sum level93 level6 level99)
(sum level93 level8 level101)
(sum level93 level9 level102)
(sum level93 level10 level103)
(sum level93 level11 level104)
(sum level94 level6 level100)
(sum level94 level8 level102)
(sum level94 level9 level103)
(sum level94 level10 level104)
(sum level94 level11 level105)
(sum level95 level6 level101)
(sum level95 level8 level103)
(sum level95 level9 level104)
(sum level95 level10 level105)
(sum level95 level11 level106)
(sum level96 level6 level102)
(sum level96 level8 level104)
(sum level96 level9 level105)
(sum level96 level10 level106)
(sum level97 level6 level103)
(sum level97 level8 level105)
(sum level97 level9 level106)
(sum level98 level6 level104)
(sum level98 level8 level106)
(sum level99 level6 level105)
(sum level100 level6 level106)

(connected l0 l2)
(fuelcost level8 l0 l2)
(connected l0 l3)
(fuelcost level9 l0 l3)
(connected l0 l4)
(fuelcost level11 l0 l4)
(connected l1 l2)
(fuelcost level6 l1 l2)
(connected l1 l3)
(fuelcost level8 l1 l3)
(connected l2 l0)
(fuelcost level8 l2 l0)
(connected l2 l1)
(fuelcost level6 l2 l1)
(connected l2 l3)
(fuelcost level10 l2 l3)
(connected l3 l0)
(fuelcost level9 l3 l0)
(connected l3 l1)
(fuelcost level8 l3 l1)
(connected l3 l2)
(fuelcost level10 l3 l2)
(connected l3 l4)
(fuelcost level18 l3 l4)
(connected l4 l0)
(fuelcost level11 l4 l0)
(connected l4 l3)
(fuelcost level18 l4 l3)

(at t0 l1)
(fuel t0 level106)
(= (total-cost) 0)

(at p0 l3)
(at p1 l3)
(at p2 l4)
(at p3 l3)
(at p4 l1)
(at p5 l3)
(at p6 l2)
(at p7 l2)
(at p8 l1)
(at p9 l0)
(at p10 l0)
(at p11 l4)
)

(:goal
(and
(at p0 l2)
(at p1 l4)
(at p2 l0)
(at p3 l2)
(at p4 l0)
(at p5 l0)
(at p6 l4)
(at p7 l0)
(at p8 l2)
(at p9 l2)
(at p10 l2)
(at p11 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p8 t0 l1)
   deleted: (at p8 l1)
   added: (in p8 t0)
   goals met: 0 of 12
2. (load p4 t0 l1)
   deleted: (at p4 l1)
   added: (in p4 t0)
   goals met: 0 of 12
3. (drive t0 l1 l2 level100 level6 level106)
   deleted: (at t0 l1) (fuel t0 level106)
   added: (at t0 l2) (fuel t0 level100)
   goals met: 0 of 12
4. (load p7 t0 l2)
   deleted: (at p7 l2)
   added: (in p7 t0)
   goals met: 0 of 12
5. (load p6 t0 l2)
   deleted: (at p6 l2)
   added: (in p6 t0)
   goals met: 0 of 12
6. (drive t0 l2 l3 level90 level10 level100)
   deleted: (at t0 l2) (fuel t0 level100)
   added: (at t0 l3) (fuel t0 level90)
   goals met: 0 of 12
7. (load p5 t0 l3)
   deleted: (at p5 l3)
   added: (in p5 t0)
   goals met: 0 of 12
8. (load p3 t0 l3)
   deleted: (at p3 l3)
   added: (in p3 t0)
   goals met: 0 of 12
9. (load p1 t0 l3)
   deleted: (at p1 l3)
   added: (in p1 t0)
   goals met: 0 of 12
10. (load p0 t0 l3)
   deleted: (at p0 l3)
   added: (in p0 t0)
   goals met: 0 of 12
11. (drive t0 l3 l4 level72 level18 level90)
   deleted: (at t0 l3) (fuel t0 level90)
   added: (at t0 l4) (fuel t0 level72)
   goals met: 0 of 12
12. (unload p6 t0 l4)
   deleted: (in p6 t0)
   added: (at p6 l4)
   goals met: 1 of 12
13. (unload p1 t0 l4)
   deleted: (in p1 t0)
   added: (at p1 l4)
   goals met: 2 of 12
14. (load p2 t0 l4)
   deleted: (at p2 l4)
   added: (in p2 t0)
   goals met: 2 of 12
15. (load p11 t0 l4)
   deleted: (at p11 l4)
   added: (in p11 t0)
   goals met: 2 of 12
16. (drive t0 l4 l0 level61 level11 level72)
   deleted: (at t0 l4) (fuel t0 level72)
   added: (at t0 l0) (fuel t0 level61)
   goals met: 2 of 12
17. (load p10 t0 l0)
   deleted: (at p10 l0)
   added: (in p10 t0)
   goals met: 2 of 12
18. (load p9 t0 l0)
   deleted: (at p9 l0)
   added: (in p9 t0)
   goals met: 2 of 12
19. (unload p11 t0 l0)
   deleted: (in p11 t0)
   added: (at p11 l0)
   goals met: 3 of 12
20. (unload p2 t0 l0)
   deleted: (in p2 t0)
   added: (at p2 l0)
   goals met: 4 of 12
21. (unload p4 t0 l0)
   deleted: (in p4 t0)
   added: (at p4 l0)
   goals met: 5 of 12
22. (unload p5 t0 l0)
   deleted: (in p5 t0)
   added: (at p5 l0)
   goals met: 6 of 12
23. (unload p7 t0 l0)
   deleted: (in p7 t0)
   added: (at p7 l0)
   goals met: 7 of 12
24. (drive t0 l0 l2 level53 level8 level61)
   deleted: (at t0 l0) (fuel t0 level61)
   added: (at t0 l2) (fuel t0 level53)
   goals met: 7 of 12
25. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 8 of 12
26. (unload p10 t0 l2)
   deleted: (in p10 t0)
   added: (at p10 l2)
   goals met: 9 of 12
27. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 10 of 12
28. (unload p8 t0 l2)
   deleted: (in p8 t0)
   added: (at p8 l2)
   goals met: 11 of 12
29. (unload p9 t0 l2)
   deleted: (in p9 t0)
   added: (at p9 l2)
   goals met: 12 of 12
